import Link from "next/link";

const data = [
    {
      textButton: "روش‌های پرداخت کارفرما چیست؟",
      children:
        "کارفرما می‌تواند از طریق درگاه آنلاین پلتفرم و یا انتقال بین بانکی، مبلغ کار را به حساب WINaTALENT منتقل کند.",
    },
    {
      textButton: "مبلغ هر milestone چه زمانی به حساب تلنت منتقل می‌شود؟",
      children:
        "پس از اتمام هر بخش کار و انتقال مبلغ آن به کیف پولتان، شما می‌توانید درخواست برداشت خود را ثبت کنید و طی حداکثر ۵ روز کاری، معادل ریالی درآمد خود را دریافت کنید.",
    },
    {
      textButton: "آیا کارفرما فاکتور و رسید پرداخت دریافت می‌کند؟",
      children:
        "بله، کارفرما پس از پرداخت می‌تواند اسناد رسمی پرداخت را در حساب WINaTALENT خود مشاهده و دانلود کند.",
    },
    {
      textButton: "کارمزد این سرویس چقدر است؟",
      children:
        "کارمزد خدمات پلتفرم (حساب واسطه، مدیریت پروژه، پرداخت معتبر) ۵٪ از هر پرداخت کارفرما، و کارمزد تبدیل درآمد ارزی به معادل ریالی، ۱ الی ۲ درصد از مبلغ درخواست شده است.",
    },
    {
      textButton: "امکان پرداخت کارفرما با چه ارزهایی وجود دارد؟",
      children:
        "کارفرما می‌تواند با تمامی ارزهای رایج بین‌المللی پرداخت خود را انجام دهد و معادل یورویی آن را برای کار در پلتفرم دریافت کند.",
    },
    {
      textButton: "به چه شکل‌هایی می‌توان یک پروژه را در WINaTALENT تعریف کرد؟",
      children:
        "کارفرما می‌تواند پروژه را به شکل ماهانه، ساعتی، و یا یک عدد ثابت تعریف کند.",
    },
    {
      textButton: "نرخ تبدیل ارز بر چه اساسی محاسبه می‌شود؟",
      children: (
        <p>
          نرخ ارز یورو در WINaTALENT، به صورت روزانه تعیین شده و از{" "}
          <Link className="text-[#28ABA7] underline" href="/">
            اینجا
          </Link>{" "}
          قابل مشاهده است.
        </p>
      ),
    },
    {
      textButton: "حساب واسطه WINaTALENT چگونه کار می‌کند؟",
      children:
        "کارفرما باید همزمان با ساختن پروژه، و یا همزمان با ایجاد یک فاز (milestone) جدید، مبلغ آن را به حساب واسطه WINaTALENT پرداخت کند. این مبلغ نزد WINaTALENT باقی می‌ماند تا زمانی که کارفرما اتمام آن فاز را اعلام کند و مبلغ پروژه از این حساب واسطه به حساب فریلنسر منتقل شود.",
    },
    {
      textButton: "آیا این سرویس فقط برای پروژه‌های کوتاه مدت مناسب است؟",
      children:
        "خیر، حتی در صورتی که شما یک شغل تمام وقت دارید، می‌توانید از طریق این سرویس و با تعریف پروژه به صورت ماهانه، هر ماه حقوق خود را دریافت نمایید.",
    },
  ];


  export default data;