import arrow from "@/feature/payment-tr/assets/arrow.svg";

import Collapsible from "../../../components/collapsible";
import { getPrice } from "../data/price";


const Main = async () => {
  const data = await getPrice();

  const date_time =
    data && new Date(data.updated_at).toLocaleString("fa-IR").split(",");
  return (
    <main className="mt-14 text-justify lg:p-0 lg:m-0 lg:mx-1">
      <Collapsible textButton="سیاست ها و قوانین سایت" srcIcon={arrow}>
        <ul className="text-lg font-bold text-start px-6  lg:text-sm lg:font-medium">
          <li>تعریف کاربر</li>
        </ul>
        <p className="text-start mt-2.5 font-light text-base mb-7 lg:text-sm lg:font-normal">
          کاربر به کسی گفته می شود که از طریق فرم ثبت نام سایت WINaTALENT.com
          اطلاعات خود را وارد کرده و به عنوان فریلنسر یا کارفرما ثبت نام کرده
          است.
        </p>
        <ul className="text-lg font-bold text-start px-6 lg:text-sm lg:font-medium">
          <li>مسیرهای ارتباطی</li>
        </ul>
        <div className="text-start mt-2.5 font-light text-base mb-7 lg:text-sm lg:font-normal">
          <p>
            WINaTALENT با شما، تنها از طریق اطلاعات ثبت نامی‌تان با شما در
            ارتباط خواهد بود (ایمیل و شماره تلفن). WINaTALENT ممکن است از طریق
            ایمیل، پیامک و یا تماس تلفنی با شما ارتباط برقرار کند. قابلیت تنظیم
            اعلان های دریافتی در پروفایل شما وجود دارد.
          </p>
          <p>
            سرویس WINaTALENT تنها از مسیرهای زیر برای ارتباط با شما برقرار خواهد
            کرد :
          </p>
          <p>دامنه های winatalent.com و talentedjob.ir برای ارسال ایمیل .</p>
          <p>سرشماره 981000227777+ برای ارسال پیامک</p>
        </div>
        <ul className="text-lg font-bold text-start px-6 lg:text-sm lg:font-medium">
          <li>حذف حساب</li>
        </ul>
        <p className="text-start mt-2.5 font-light text-base mb-7 lg:text-sm lg:font-normal">
          قابلیت حذف حساب در پروفایل شما وجود دارد و هر کاربر در هر زمانی می
          تواند با استفاده از این قابلیت، پروفایل خود را حذف کند. WINaTALENT در
          این مورد از قوانین EU General Data Protection Regulation (GDPR) پیروی
          میکند. لازم به ذکر است پس از حذف حساب، هیچ راهی برای بازگرداندن آن
          وجود ندارد. همچنین در صورتی که WINaTALENT تشخیص دهد کاربری حساب قبلی
          خود به دلیل دریافت بازخوردهای منفی حذف کرده و حساب جدیدی ایجاد کرده
          است، حساب جدید نیز حذف خواهد شد.
        </p>
        <ul className="text-lg font-bold text-start px-6 lg:text-sm lg:font-medium">
          <li>رعایت حریم شخصی</li>
        </ul>
        <div className="text-start mt-2.5 font-light text-base mb-7 lg:text-sm lg:font-normal">
          <p>
            WINaTALENT به اطلاعات خصوصی اشخاصی که از خدمات سایت استفاده می‏‌کنند
            ، احترام گذاشته و از آن محافظت می‏‌کند .
          </p>
          <p>
            WINaTALENT متعهد می‏‌شود در حد توان از حریم شخصی شما دفاع کند و در
            این راستا ، تکنولوژی مورد نیاز برای هرچه مطمئن‏‌تر و امن‏‌تر شدن
            استفاده شما از سایت را ، توسعه دهد . در واقع با استفاده از سایت
            WINaTALENT شما رضایت خود را از این سیاست نشان می‏‌دهید .
          </p>
          <p>
            همه مطالب در دسترس از طریق هر یک از خدمات WINaTALENT مانند متن ،
            گرافیک ، آرم ، آیکون ، دکمه ، تصاویر ، ویدئوهای تصویری ، موارد قابل
            دانلود و کپی ، داده‌ها و کلیه محتوای تولید شده توسط WINaTALENT جزئی
            از اموال WINaTALENT محسوب می‏‌شود و حق استفاده و نشر تمامی مطالب
            موجود و در دسترس در انحصار WINaTALENT است و هرگونه استفاده بدون کسب
            مجوز کتبی ، حق پیگرد قانونی را برای WINaTALENT محفوظ می‏‌دارد .
            علاوه بر این ، اسکریپت‌ها ، و اسامی خدمات قابل ارائه از طریق هر یک
            از خدمات ایجاد شده توسط WINaTALENT و علائم تجاری ثبت شده نیز در
            انحصار WINaTALENT است و هر گونه استفاده با مقاصد تجاری پیگرد قانونی
            دارد . کاربران مجاز به بهره‌‏برداری و استفاده از لیست پروژه ها ،
            مشخصات فنی و هر گونه استفاده از مشتقات وب‏‌سایت WINaTALENT و یا هر
            یک از خدمات و یا مطالب ، دانلود یا کپی کردن اطلاعات با مقاصد تجاری ،
            هر گونه استفاده از داده کاوی ، روبات یا روش‌‏های مشابه مانند جمع
            آوری داده‌‏ها و ابزارهای استخراج نیستند و کلیه این حقوق به صراحت
            برای WINaTALENT محفوظ است . در صورت استفاده از هر یک از خدمات
            WINaTALENT کاربران مسئول حفظ محرمانه بودن حساب و رمز عبور خود هستند
            و تمامی مسئولیت فعالیت‌‏هایی که تحت حساب کاربری و یا رمز ورود انجام
            می‏‌پذیرد به عهده کاربران است .
          </p>
        </div>
      </Collapsible>
      <Collapsible textButton="نحوه انجام کار و پرداخت ها" srcIcon={arrow}>
        <ul className="text-base font-medium text-start pr-5 list-disc lg:text-sm">
          <li>
            WINaTALENT سرویس کاریابی بین المللی است و تمرکز اصلی آن بر انجام
            هرچه بهتر این ماموریت است. در کنار این ماموریت، WINaTALENT خدمات
            انتقال و تبدیل ارز را نیز به منظور تکمیل فرآیند برای کارجوهای خود
            انجام می دهد.
          </li>
          <li>
            زمانی که کاربر درآمد خود را درکیف پول خود WINaTALENT دریافت می کند ،
            می تواند یک درخواست برداشت ثبت کند. درخواست برداشت به معنی درخواست
            دریافت معادل ریالی درآمدهای ارزی کارجو از سایت WINaTALENT است.
          </li>
          <li>
            هر درخواست در اولین روز کاری و پس از آپدیت نرخ ارز آن روز بررسی
            می‌شوند.
          </li>
          <li>
            پس از بررسی درخواست، جزییات درخواست و نرخ به کاربر اعلام شده و در
            فاصله ۵ روز کاری پس از ثبت درخواست، معادل ریالی به حساب کاربر منتقل
            خواهد شد.
          </li>
          <li>
            بین ۱٪ الی ۲٪ کارمزد تبدیل و انتقال برای دریافت ریالی درآمدهای کیف
            پول کارجوهای WINaTALENT اعمال می‌شود.
          </li>
          <li>
            این کارمزد روی اعتبار یورویی کیف پول کارجو (که درخواست برداشت آن ثبت
            شده) اعمال می‌شود. کارمزد پلتفرم (۵٪ برای پروژه های BYO) در مرحله
            قبل از انتقال به کیف پول کارجو کسر شده است.
          </li>
          <li>
            در صورتی که فرآیند انتقال و تبدیل ارز به هر دلیلی به مشکل خورده
            باشد، WINaTALENT این موضوع را به کاربر اطلاع خواهد داد. لازم به ذکر
            است در زمانی که مشکل حل شود پرداخت به کاربر انجام خواهد شد.
          </li>
          <li>
            WINaTALENT در فرایند تبدیل ارز، نرخ خود را ملاک محاسبات قرار می‌دهد.
            در بخش بعد، اطلاعات بیشتری در مورد نرخ ارز بیان شده است.
          </li>
          <li>
            WINaTALENT مسئول شرایط و قوانینی که در فرآیند انتقال درآمد ارزی رخ
            می‌دهد و حیطه کنترل WINaTALENT نیست نمی‌باشد .
          </li>
          <li>
            کاربران با استفاده از WINaTALENT این را می پذیرند که ممکن است در
            فرایند انتقال و تبدیل درآمد ارزی آن ها، ریسک هایی خارج از کنترل
            WINaTALENT وجود داشته باشد ، و این ریسک ها موجب تأخیر در پرداخت به
            کاربر و یا حتی بلاک شدن پرداخت کاربر برای مدت طولانی و یا دائمی
            شوند.
          </li>
          <li>
            در شرایطی که هرگونه ریسکی متوجه این فرایند شود ، WINaTALENT تمام
            تجربه و دانش خود را برای حل هرچه سریعتر مشکل به کار خواهد گرفت. در
            عین حال WINaTALENT هیچ مسئولیتی برای جبران خسارت های ناشی از ریسک
            های خارج از فرآیند خود ندارد.
          </li>
        </ul>
      </Collapsible>
      <Collapsible textButton="نرخ ارز" srcIcon={arrow}>
        <ul className="text-base font-medium text-start pr-5 list-disc lg:text-sm">
          <li className="">
            معیار کار WINaTALENT ارز یورو است. در صورتی که کارفرما پرداختی به
            ارز دیگری داشته باشد، معادل یورویی آن طبق نرخ تبدیل روز در حساب
            WINaTALENT اضافه خواهد شد.
          </li>
          <li>
            نرخ یورو در روزهای کاری (شنبه تا چهارشنبه غیر تعطیل) در همین بخش
            آپدیت می‌شود.
          </li>
          <li>
            نرخ ارز هر روز، در بازه زمانی ۱۲ ظهر تا ۴ بعد از ظهر آن روز معتبر
            است.
          </li>
          <li>
            درخواست‌هایی که بعد از ساعت ۴ بعد از ظهر ثبت شوند، با نرخ روز کاری
            بعد محاسبه خواهد شد.
          </li>

          <li>
            <span>نرخ یورو:{data?.price}</span>
          </li>
          <li>
            زمان به روز رسانی:
            <span className="inline-flex gap-2 mr-2 items-center">
              {date_time?.map((item: string, index: number) => (
                <span key={item}>
                  {item}
                  {index === 0 && ","}
                </span>
              ))}
            </span>
          </li>
        </ul>
      </Collapsible>
    </main>
  );
};

export default Main;
